-- Заповнення таблиць даними
INSERT INTO worker
    (NAME, BIRTHDAY, LEVEL, SALARY)
VALUES ('Іван Петренко', TO_DATE('1990-05-15', 'YYYY-MM-DD'), 'Middle', 80000),
       ('Олена Коваленко', TO_DATE('1985-09-22', 'YYYY-MM-DD'), 'Senior', 95000),
       ('Марія Лисенко', TO_DATE('1993-11-10', 'YYYY-MM-DD'), 'Trainee', 60000),
       ('Богдан Шевченко', TO_DATE('1982-03-30', 'YYYY-MM-DD'), 'Junior', 75000),
       ('Єва Біла', TO_DATE('1995-07-08', 'YYYY-MM-DD'), 'Senior', 90000),
       ('Олександр Бровко', TO_DATE('1988-01-18', 'YYYY-MM-DD'), 'Senior', 100000),
       ('Лаура Дейвіс', TO_DATE('1991-12-05', 'YYYY-MM-DD'), 'Trainee', 55000),
       ('Марк Тейлор', TO_DATE('1987-06-25', 'YYYY-MM-DD'), 'Junior', 72000),
       ('Софія Вільсон', TO_DATE('1994-04-14', 'YYYY-MM-DD'), 'Middle', 88000),
       ('Райан Кларк', TO_DATE('1984-08-17', 'YYYY-MM-DD'), 'Senior', 98000);


INSERT INTO client (NAME)
VALUES ('Apple'),
       ('Google'),
       ('Microsoft'),
       ('OnlyFans'),
       ('Amazon');


INSERT INTO project (CLIENT_ID, START_DATE, FINISH_DATE)
VALUES
    (1, '2012-01-15', '2019-10-15'),
    (2, '2013-02-28', '2020-06-20'),
    (3, '2019-06-18', '2023-11-10'),
    (4, '2019-10-23', '2022-09-15'),
    (1, '2013-02-20', '2015-02-11'),
    (5, '2014-07-10', '2015-02-28'),
    (2, '2014-09-28', '2015-01-10'),
    (4, '2015-03-20', '2016-10-07'),
    (3, '2015-06-28', '2017-12-10'),
    (5, '2016-06-20', '2017-12-15'),
    (1, '2017-02-15', '2019-12-15'),
    (3, '2018-08-28', '2020-02-10'),
    (5, '2020-08-20', '2020-02-15'),
    (2, '2012-02-28', '2021-03-10'),
    (1, '2012-01-20', '2014-03-11'),
    (4, '2013-12-23', '2017-11-15'),
    (2, '2014-12-28', '2020-08-20'),
    (4, '2016-04-20', '2017-11-07'),
    (5, '2014-09-10', '2015-04-30'),
    (3, '2013-06-19', '2017-11-10');




INSERT INTO project_worker
(PROJECT_ID, WORKER_ID)
VALUES (1, 1),
       (1, 3),
       (1, 5),
       (2, 4),
       (2, 6),
       (2, 8),
       (3, 2),
       (3, 7),
       (3, 9),
       (4, 10),
       (4, 1),
       (4, 5),
       (5, 9),
       (5, 3),
       (5, 6);

